In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [77]:
pd.set_option('display.max_rows',317)

In [57]:
df1 = pd.read_excel('Dwellings by LA 2005-2021, Quarterly.xlsx', index_col=0)
df1.head()

,DLUHC Code,Former ONS Code,ONS Code,Local Authority,DS_P,DS_HA,DS_LA,DS_Total,DC_P,DC_HA,DC_LA,DC_Total,quarter
0,F0114,00HA,E06000022,Bath and North East Somerset UA,40,20,0,60,30,0,0,30,2005 Q1
1,M2372,00EX,E06000008,Blackburn with Darwen UA,30,0,0,30,110,10,0,120,2005 Q1
2,J2373,00EY,E06000009,Blackpool UA,20,10,0,30,60,40,0,100,2005 Q1
3,G1250,00HN,E06000028,Bournemouth UA,90,0,0,90,110,10,0,120,2005 Q1
4,R0335,00MA,E06000036,Bracknell Forest UA,80,20,0,100,40,10,0,50,2005 Q1

In [4]:
df2 = pd.read_excel('2015 Real Median House Price by LA 1995-2021, Quarterly.xlsx', index_col=0)
df2.head()

     LA_code          LA  quarter   median  cpih   real_median
0  E06000001  Hartlepool  1995 Q4  36500.0  67.2  54315.476190
1  E06000001  Hartlepool  1996 Q1  37500.0  67.7  55391.432792
2  E06000001  Hartlepool  1996 Q2  38500.0  68.5  56204.379562
3  E06000001  Hartlepool  1996 Q3  39000.0  68.7  56768.558952
4  E06000001  Hartlepool  1996 Q4  40000.0  69.2  57803.468208

In [6]:
df3 = pd.read_excel('Real Interest Rates 1995-2021, Quarterly.xlsx', index_col=0)
df3.head()

   quarter  interest_rate  cpih  inflation_rate  real_interest
0  1995 Q1       8.661467  65.7             NaN            NaN
1  1995 Q2       8.242567  66.7        1.522070       6.720497
2  1995 Q3       8.108933  66.9        0.299850       7.809083
3  1995 Q4       7.788167  67.2        0.448430       7.339736
4  1996 Q1       7.753200  67.7        0.744048       7.009152

In [58]:
df1 = df1[['ONS Code','Local Authority','DC_Total','quarter']]
df1.rename(columns={'ONS Code':'LA_code','Local Authority':'LA'}, inplace=True)

In [13]:
df2 = df2[['LA_code','LA','quarter','real_median']]

In [55]:
for x in df1.LA_code.unique():
    if x not in df2.LA_code.unique():
        print(df1[df1.loc[:,'LA_code']==x].LA.unique())

['Bournemouth UA']
['Poole UA']
['Gateshead']
['Bedford']
['Mid Bedfordshire']
['South Bedfordshire']
['Aylesbury Vale']
['Chiltern']
['South Bucks']
['Wycombe']
['Chester']
['Congleton']
['Crewe and Nantwich']
['Ellesmere Port & Neston']
['Macclesfield']
['Vale Royal']
['Caradon']
['Carrick']
['Isles of Scilly']
['Kerrier']
['North Cornwall']
['Penwith']
['Restormel']
['Christchurch']
['East Dorset']
['North Dorset']
['Purbeck']
['West Dorset']
['Weymouth and Portland']
['Chester-le-Street']
['Derwentside']
['Durham']
['Easington']
['Sedgefield']
['Teesdale']
['Wear Valley']
['East Hertfordshire']
['St Albans']
['Stevenage']
['Welwyn Hatfield']
['Corby']
['Daventry']
['East Northamptonshire']
['Kettering']
['Northampton']
['South Northamptonshire']
['Wellingborough']
['Alnwick']
['Berwick-upon-Tweed']
['Blyth Valley']
['Castle Morpeth']
['Tynedale']
['Wansbeck']
['Bridgnorth']
['North Shropshire']
['Oswestry']
['Shrewsbury and Atcham']
['South Shropshire']
['Taunton Deane']
['West Somerset']
['Forest Heath']
['St Edmundsbury']
['Suffolk Coastal']
['Waveney']
['Kennet']
['North Wiltshire']
['Salisbury']
['West Wiltshire']
['Northumberland UA']

In [59]:
len(df1.LA_code.unique())

378

In [60]:
len(df2.LA_code.unique())

331

In [38]:
for x in df2.LA_code.unique():
    if x not in df1.LA_code.unique():
        print(df2[df2.loc[:,'LA_code']==x].LA_code.unique())

['W06000001']
['W06000002']
['W06000003']
['W06000004']
['W06000005']
['W06000006']
['W06000008']
['W06000009']
['W06000010']
['W06000011']
['W06000012']
['W06000013']
['W06000014']
['W06000015']
['W06000016']
['W06000018']
['W06000019']
['W06000020']
['W06000021']
['W06000022']
['W06000023']
['W06000024']

In [66]:
df = pd.merge(df1,df2,on=['LA_code','quarter'],how='inner')
df.drop(columns='LA_y',inplace=True)
df.rename(columns={'LA_x':'LA'},inplace=True)

In [68]:
df.head()

,LA_code,LA,DC_Total,quarter,real_median
0,E06000022,Bath and North East Somerset UA,30,2005 Q1,245350.318471
1,E06000008,Blackburn with Darwen UA,120,2005 Q1,92993.630573
2,E06000009,Blackpool UA,100,2005 Q1,122292.993631
3,E06000036,Bracknell Forest UA,50,2005 Q1,235668.789809
4,E06000043,Brighton and Hove UA,110,2005 Q1,235668.789809

In [91]:
counter = df[['LA_code','quarter']].groupby('LA_code').count().rename(columns={'quarter':'n'})
counter[counter.loc[:,'n']!=67].count()

n    23
dtype: int64

In [90]:
len(df.LA_code.unique())

309